app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '5cad28b1c9b4e0e6eebb7d5e1e5cf352fa6b76fd', '2010-08-04 02:08:54', '32f10031b8f5d1c3f9251ba0cdb69118f2ab77b2', NULL, NULL, 'test', 'test@example.com', '2010-08-04 02:08:54')